## Plan Result (fxa-webhook-proxy-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/10711179836)



<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609 will be updated in-place
  ~ resource "aws_lambda_function" "proxy-lambda_fxa-events-sqs-lambda_39345609" {
        id                             = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
      ~ layers                         = [
          + "arn:aws:lambda:us-east-1:177933569100:layer:AWS-Parameters-and-Secrets-Lambda-Extension:11",
        ]
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:1279" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:1279/invocations" -> (known after apply)
        tags                           = {
            "app_code"       = "pocket"
            "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ version                        = "1279" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":718,"Program":"tfcmt","SHA1":"e75c6536fdd143e9d1c3edec891599b7064d1f11","Target":"fxa-webhook-proxy-cdk-production","Vars":{},"WorkflowName":"FxA Webhook Proxy"} -->